src/InformationRegisters/ЗадачиРелиза/ЗадачиРелиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиРелиза</name>
  <resources>
    <name>Принял</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Принята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НетЗадачиВГит</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НетЗадачиВБитрикс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>DocumentRef.Релиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗадачиРелиза/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписиПоЗадачамРелиза(Релиз, ЗадачаРелиза, НетЗадачиВГит, НетЗадачиВБитрикс) Экспорт
	
	ДанныеЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаРелиза, "Ответственный, Постановщик");
	
	НаборЗаписей = РегистрыСведений.ЗадачиРелиза.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Релиз.Установить(Релиз);
	НаборЗаписей.Отбор.Задача.Установить(ЗадачаРелиза);
	НаборЗаписей.Отбор.Ответственный.Установить(ДанныеЗадачи.Ответственный);
	НаборЗаписей.Отбор.Постановщик.Установить(ДанныеЗадачи.Постановщик);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Задача = ЗадачаРелиза;
		Запись.Ответственный = ДанныеЗадачи.Ответственный;
		Запись.Постановщик = ДанныеЗадачи.Постановщик;
		Запись.Релиз = Релиз;
	Иначе
		Запись = НаборЗаписей[0];
		Запись.НетЗадачиВГит = НетЗадачиВГит;
		Запись.НетЗадачиВБитрикс = НетЗадачиВБитрикс;
	КонецЕсли;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
